package com.bcv.lessons.BoostBrain.lesson_6;

public class Packages {
/*    Пакеты и классы.
    1. Пакеты - это способ группировки классов.
    2. В файловой системе каждый пакет представлен отдельным каталогом.
    3. Имя пакета соответствует файловому пути от корня проекта, но вместо слэшей в имени пакета используются точки.
    4. Принадлежность класса к пакету обозначается ключевым словом package в первой строке файла с описанием класса.
    5. Чтобы можно было использовать класс из другого пакета, его нужно импортировать с помощью ключевого слова import.
    */
}
