package com.bcv.BoostBrain.Lesson_17;
/*Аннотации
1. Аннотации в Java - это специальные метки, которыми можно помечать классы, методы или переменные.
2. Аннотации могут быть использованы для анализа кода, во время компиляции или во время исполнения программы.
3. В Java есть как встроенные аннотации, так и возможность создавать и использовать свои собственные.
4. Аннотация выглядит как @ИмяАннотации(параметр1 = значение1, параметр2 = значение2...), но может быть и без параметров.

Стандартные аннотации
1. @Override - применяется к методу и указывает компилятору, что метод должен быть переопределением метода в родителе.
2. @Deprecated - помечает элемент класса как устаревший, предупреждает, что его не надо использовать в дальнейшем.
3. @SuppressWarnings(тип предупреждения) - запрет компилятору выводить предупреждения.
*/
public class Annotations {

}
