package com.bcv.lessons;
/*Вывести на консоль IDE символ скрипичного ключа (G-Clef)
 * 1. Для вывода скачал дополнительный шрифт Bravura Text
 * 2. В настройках устновил его For symbols not supported by the main font*/

public class G_Clef {
    public static void main(String[] args) {
        System.out.println("\uD834\uDD1E");
    }
}
