/*создать массив из 10 строк и в каждой строке поменять 3 рандомных символа на три рандомных символа.
Использовать метод indexOf и Random
Алгоритм
1. Создать массив
2. Создать цикл
3. Цикл на 3 прохождения
4. Используя класс Ranodom в диапазоне длины строки получаете int значения
5. Используя таблицу ASCII определить диапазон символов
6. Используя Random в этом дипазоне получить символ
7. Подставить на место 4
*/

package com.bcv.hw.Lection5;


import sun.plugin.javascript.navig.Array;

public class Lection5 {
    public static void main(String[] args) {

 /*       int arr[] = new int[10];
        for (int i = 0; i < arr.length; i++) {
            arr[i] = (int) (Math.random() * 10) + 1;
            System.out.print(arr[i] + " ");
            Array.asList(arr).indexOf((Math.random()*10)+1;
            if (arr[i] <= 3) {
                arr[i] = (int) (Math.random() * 10) + 1;
                System.out.println("second = " + arr[i] + " ");
            }
        }*/

    }


}

