package com.bcv.homeWorkLemon.Lection1;

//Напишите программу которая определяет число четное или не четное

public class Task8 {
    public static void main(String[] args) {
        int x = 123;
        if (x % 2 == 1)
            System.out.println("The number " + x + " is odd");
        else
            System.out.println("The number " + x + " is even");
    }
}
