package com.bcv.lessons.BoostBrain.lesson_18;
/*
1. JavaFX - это платформа для создания пользовательского интерфейса, который может работать как локально, так и загружаться через интернет.
2. JavaFX позиционируется как замена устаревшему Swing и может использоваться как сама по себе, так и в составе Swing приложений.
3. Элементы управления пользовательского интерфейса могут быть созданы как непосредственно в программном коде, так и в специальном файле-описании интерфейса - т.н. FXML-файл.
4. Редактировать FXML можно с помощью SceneBuilder или вручную.
*/
public class JavaFX {

}
